package Demo;

import java.util.Scanner;

public class Main {
    public static void main(String[] args) {

        //клас
        //1. полета -> характеристики
        //2. конструктор(и) -> създаване на обект от класа
            //2.1. default конструктор -> създава празен обект
            //2.2. конструктори с параметри -> създава обект и задава стойности на полетата
        //3. методи -> действия
            //3.1. getter -> методи, които осигуряват контролиран достъп до полетата
            //3.2. setter -> void методи, които контролирано задават стойност на полетата
        //4. toString -> преобразува обекта в текст

        System.out.printf(System.lineSeparator());

    }
}
